IDEA StatiCa Open Model
BeamDataEc2.TypeOfSupportRight Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of support on the right side
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public TypeOfSupportConditions TypeOfSupportRight { get; set; }
Public Property TypeOfSupportRight As TypeOfSupportConditions
	Get
	Set
public:
property TypeOfSupportConditions TypeOfSupportRight {
	TypeOfSupportConditions get ();
	void set (TypeOfSupportConditions value);
}
Property Value
Type: TypeOfSupportConditions
See Also
Reference
BeamDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace